
nearlocs={
    'площадь':['кухня', 'а.корпус', 'д4', 'д5', 'д6', 'медпункт', 'д21', 'лодочная'],
    'кухня':['площадь', 'склад'],
    'склад':['кухня', 'спортзал', 'пляж'],
    'спортзал':['склад', 'пляж'],
    'пляж':['спортзал', 'склад'],
    'а.корпус':['площадь', 'душевая', 'д21'],
    'душевая':['д21', 'д18', 'кружки', 'муз.кружок'],
    'кружки':['душевая', 'муз.кружок', 'д18', 'стоянка'],
    'стоянка':['кружки'],
    'медпункт':['д6', 'д5', 'площадь', 'библиотека', 'д12'],
    'библиотека':['медпункт', 'д12', 'сцена'],
    'сцена':['библиотека', 'д12'],
    'лодочная':['площадь', 'кухня', 'д21'],
    'д1':['д2'],
    'д2':['д1', 'д3'],
    'д3':['д2', 'д4'],
    'д4':['площадь', 'д5', 'д10'],
    'д5':['площадь', 'д6', 'д4'],
    'д6':['площадь', 'медпункт', 'д5'],
    'д7':['д8'],
    'д8':['д7', 'д9', 'д15'],
    'д9':['д8', 'д10', 'д15'],
    'д10':['д9', 'д11', 'д4', 'д5'],
    'д11':['д10', 'д12'],
    'д12':['д11', 'библиотека', 'медпункт'],
    'д13':['д14'],
    'д14':['д15', 'д13'],
    'д15':['д14', 'д16', 'д8', 'д9'],
    'д16':['д15', 'д17'],
    'д17':['д16'],
    'д18':['д19', 'д22'],
    'д19':['д18', 'д20'],
    'д20':['д19', 'д21'],
    'д21':['д23'],
    'д22':['д18', 'д24', 'д25', 'д26'],
    'д23':['д24', 'д21'],
    'д24':['д25', 'д26', 'д27', 'д23', 'д22'],
    'д25':['д22', 'д24', 'д26'],
    'д26':['д25', 'д27', 'д22', 'д24'],
    'д27':['д26', 'д28'],
    'д28':['д27', 'д29'],
    'д29':['д28', 'д30'],
    'д30':['д29', 'д31'],
    'д31':['д30', 'старый корпус'],
    'старый корпус':['д31']
    
    
}


class Pioner:
    
    def __init__(self):
        self.pioner=None
        self.currentloc=None
        self.name='Пионер'
        
        
        
class Alisa(Pioner):
    
    def __init__(self):
        super().__init__()
        self.person=pioners.find_one({'id':'alisa'})
        self.name='Алиса Двачевская'
        self.currentloc=self.person['location']
        self.currentact=self.person['action']
        
    def selectact(self):
        pass
        
        
        
        
